import wNim/[wMessageDialog, wUtils, wDataObject]

import sequtils, strutils, algorithm

# Отримаємо стрічку з буферу обміну та
# зробимо деякі зміни (я їх опишу).
# 
# Пам'ятайте, що a.fn(b, c) те саме,
# що й fn(a, b, c).
# Тобто, перший аргумент функції -
# перед крапкою.
# Це дає змогу легко відстежити
# послідовність викликів функцій (тобто,
# вони викликаються в тому порядку, в якому
# ми читаємо).
# 
# Оскільки wGetClipboard() повертає
# DataObject, ми мусимо з цього об'єкту
# витягнути текстовий вміст за допомогою
# getText() (отриматиТекст).
# 
# Отримали стрічку. В ній окремі числа
# розділяються пробілом, тож ми можемо
# відокремити їх за допомогою 
# splitWhitespace() (розділитиЗаПробілом),
# і ця функція повертає масив розділених
# стрічок.
# 
# Тепер всі стрічки у масиві потрібно
# перетворити на числа з плаваючою комою
# float (у Нім немає типу чисел з подвійною
# точністю double).
# mapIt виконує функцію над усіма елементами
# масиву через ітерацію, використовуючи
# для цього внутрішню змінну it (це), яка
# символізує елемент масиву.
# parseFloat парсить зі стрічки число з
# плаваючою комою.
#
# Отримали масив чисел. Невідсортованих.
# А як їх відсортувати? Правильно, sorted().
# Є ще функція sort(), але вона не працює
# як слід (тому що я не розібрався, як вона
# працює).
#
# Після сортування перетворимо числа назад
# в стрічку, але лишимо лише 2 числа після коми.
# string.formatFloat(ffDecimal, 2)
# 
# А тепер усі елементи масиву об'єднаємо у одну
# стрічку, причому елементи між собою розділені
# пробілом.
# array.join(" ")

let textContainer = wGetClipboard()
  .getText()
  .splitWhitespace()
  .mapIt(parseFloat(it))
  .sorted()
  .mapIt(it.formatFloat(ffDecimal, 2))
  .join(" ")

# Тепер просто виведемо на екран віконце

MessageDialog(message=textContainer,
  caption="Object3", style=wOk).display()